tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf2220_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF2220_H_
#define _PIC18LF2220_H_

#define PORTA                         0
#define AN0                           1
#define ULPWUIN                       2
#define PORTA_RA0                     3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define CVREF                         8
#define VREFM                         9
#define AN3                           10
#define PORTA_RA3                     11
#define VREFP                         12
#define PORTA_RA4                     13
#define PORTA_C1OUT                   14
#define T0CKI                         15
#define PORTA_C2OUT                   16
#define AN4                           17
#define PORTA_RA5                     18
#define LVDIN                         19
#define nSS                           20
#define NOT_SS                        21
#define SS                            22
#define CLKO                          23
#define PORTA_RA6                     24
#define OSC2                          25
#define CLKI                          26
#define PORTA_RA7                     27
#define OSC1                          28
#define RJPU                          29
#define PORTB                         30
#define INT0                          31
#define PORTB_RB0                     32
#define AN12                          33
#define INT1                          34
#define PORTB_RB1                     35
#define AN10                          36
#define AN8                           37
#define INT2                          38
#define PORTB_RB2                     39
#define CCP2A                         40
#define AN9                           41
#define PORTB_CCP2                    42
#define CCP2_PA2                      43
#define PORTB_RB3                     44
#define KBI0                          45
#define PORTB_RB4                     46
#define AN11                          47
#define PGM                           48
#define PORTB_RB5                     49
#define KBI1                          50
#define PGC                           51
#define PORTB_RB6                     52
#define KBI2                          53
#define PGD                           54
#define PORTB_RB7                     55
#define KBI3                          56
#define PORTC                         57
#define T13CKI                        58
#define T1CKI                         59
#define T1OSO                         60
#define PORTC_RC0                     61
#define PORTC_CCP2                    62
#define T1OSI                         63
#define PA2                           64
#define PORTC_RC1                     65
#define CCP1                          66
#define P1A                           67
#define PA1                           68
#define PORTC_RC2                     69
#define SCL                           70
#define SCK                           71
#define PORTC_RC3                     72
#define SDA                           73
#define SDI                           74
#define PORTC_RC4                     75
#define SDO                           76
#define PORTC_RC5                     77
#define TX                            78
#define CK                            79
#define PORTC_RC6                     80
#define DT                            81
#define RX                            82
#define PORTC_RC7                     83
#define LATA                          84
#define LATA0                         85
#define LA0                           86
#define LATA1                         87
#define LA1                           88
#define LATA2                         89
#define LA2                           90
#define LATA3                         91
#define LA3                           92
#define LATA4                         93
#define LA4                           94
#define LATA5                         95
#define LA5                           96
#define LATA6                         97
#define LA6                           98
#define LATA7                         99
#define LA7                           100
#define LATB                          101
#define LB0                           102
#define LATB0                         103
#define LB1                           104
#define LATB1                         105
#define LB2                           106
#define LATB2                         107
#define LB3                           108
#define LATB3                         109
#define LB4                           110
#define LATB4                         111
#define LB5                           112
#define LATB5                         113
#define LB6                           114
#define LATB6                         115
#define LB7                           116
#define LATB7                         117
#define LATC                          118
#define LATC0                         119
#define LC0                           120
#define LATC1                         121
#define LC1                           122
#define LATC2                         123
#define LC2                           124
#define LATC3                         125
#define LC3                           126
#define LATC4                         127
#define LC4                           128
#define LATC5                         129
#define LC5                           130
#define LATC6                         131
#define LC6                           132
#define LATC7                         133
#define LC7                           134
#define TRISA                         135
#define TRISA0                        136
#define TRISA_RA0                     137
#define TRISA1                        138
#define TRISA_RA1                     139
#define TRISA2                        140
#define TRISA_RA2                     141
#define TRISA3                        142
#define TRISA_RA3                     143
#define TRISA_RA4                     144
#define TRISA4                        145
#define TRISA_RA5                     146
#define TRISA5                        147
#define TRISA_RA6                     148
#define TRISA6                        149
#define TRISA_RA7                     150
#define TRISA7                        151
#define TRISB                         152
#define TRISB_RB0                     153
#define TRISB0                        154
#define TRISB_RB1                     155
#define TRISB1                        156
#define TRISB_RB2                     157
#define TRISB2                        158
#define TRISB_RB3                     159
#define TRISB3                        160
#define TRISB_RB4                     161
#define TRISB4                        162
#define TRISB_RB5                     163
#define TRISB5                        164
#define TRISB_RB6                     165
#define TRISB6                        166
#define TRISB_RB7                     167
#define TRISB7                        168
#define TRISC                         169
#define TRISC0                        170
#define TRISC_RC0                     171
#define TRISC1                        172
#define TRISC_RC1                     173
#define TRISC2                        174
#define TRISC_RC2                     175
#define TRISC3                        176
#define TRISC_RC3                     177
#define TRISC4                        178
#define TRISC_RC4                     179
#define TRISC5                        180
#define TRISC_RC5                     181
#define TRISC6                        182
#define TRISC_RC6                     183
#define TRISC7                        184
#define TRISC_RC7                     185
#define OSCTUN2                       186
#define OSCTUN2_TUN0                  187
#define OSCTUN2_TUN                   188
#define OSCTUN2_TUN1                  189
#define OSCTUN2_TUN2                  190
#define OSCTUN2_TUN3                  191
#define OSCTUN2_TUN4                  192
#define OSCTUN2_TUN5                  193
#define TUNSEL                        194
#define OSCTUNE                       195
#define OSCTUNE_TUN                   196
#define OSCTUNE_TUN0                  197
#define OSCTUNE_TUN1                  198
#define OSCTUNE_TUN2                  199
#define OSCTUNE_TUN3                  200
#define OSCTUNE_TUN4                  201
#define OSCTUNE_TUN5                  202
#define PIE1                          203
#define TMR1IE                        204
#define TMR2IE                        205
#define CCP1IE                        206
#define SSPIE                         207
#define TXIE                          208
#define TX1IE                         209
#define RCIE                          210
#define RC1IE                         211
#define ADIE                          212
#define PIR1                          213
#define TMR1IF                        214
#define TMR2IF                        215
#define CCP1IF                        216
#define SSPIF                         217
#define TXIF                          218
#define TX1IF                         219
#define RCIF                          220
#define RC1IF                         221
#define ADIF                          222
#define IPR1                          223
#define TMR1IP                        224
#define TMR2IP                        225
#define CCP1IP                        226
#define SSPIP                         227
#define TX1IP                         228
#define TXIP                          229
#define RC1IP                         230
#define RCIP                          231
#define ADIP                          232
#define PIE2                          233
#define CCP2IE                        234
#define TMR3IE                        235
#define LVDIE                         236
#define BCLIE                         237
#define EEIE                          238
#define CMIE                          239
#define OSCFIE                        240
#define PIR2                          241
#define CCP2IF                        242
#define TMR3IF                        243
#define LVDIF                         244
#define BCLIF                         245
#define EEIF                          246
#define CMIF                          247
#define OSCFIF                        248
#define IPR2                          249
#define CCP2IP                        250
#define TMR3IP                        251
#define LVDIP                         252
#define BCLIP                         253
#define EEIP                          254
#define CMIP                          255
#define OSCFIP                        256
#define EECON1                        257
#define RD                            258
#define WR                            259
#define WREN                          260
#define WRERR                         261
#define FREE                          262
#define CFGS                          263
#define EEFS                          264
#define EEPGD                         265
#define RCSTA                         266
#define RCD8                          267
#define RX9D                          268
#define OERR                          269
#define FERR                          270
#define ADDEN                         271
#define ADEN                          272
#define CREN                          273
#define SRENA                         274
#define SREN                          275
#define RC9                           276
#define RC8_9                         277
#define RX9                           278
#define SPEN                          279
#define TXSTA                         280
#define TXD8                          281
#define TX9D1                         282
#define TX9D                          283
#define TRMT                          284
#define TRMT1                         285
#define BRGH1                         286
#define BRGH                          287
#define SYNC                          288
#define SYNC1                         289
#define TXEN1                         290
#define TXEN                          291
#define TX91                          292
#define TX8_9                         293
#define TX9                           294
#define CSRC1                         295
#define CSRC                          296
#define T3CON                         297
#define TMR3ON                        298
#define TMR3CS                        299
#define nT3SYNC                       300
#define NOT_T3SYNC                    301
#define T3SYNC                        302
#define SOSCEN3                       303
#define T3CCP1                        304
#define T3CKPS                        305
#define T3CKPS0                       306
#define T3CKPS1                       307
#define T3CCP2                        308
#define T3CON_RD16                    309
#define RD163                         310
#define T3RD16                        311
#define CMCON                         312
#define CM                            313
#define CMEN0                         314
#define CM0                           315
#define CMEN1                         316
#define CM1                           317
#define CMEN2                         318
#define CM2                           319
#define CIS                           320
#define C1INV                         321
#define C2INV                         322
#define CMCON_C1OUT                   323
#define CMCON_C2OUT                   324
#define CVRCON                        325
#define CVR                           326
#define CVR0                          327
#define CVR1                          328
#define CVR2                          329
#define CVR3                          330
#define CVRR                          331
#define CVROEN                        332
#define CVROE                         333
#define CVREN                         334
#define CCP2CON                       335
#define CCP2M                         336
#define CCP2M0                        337
#define CCP2M1                        338
#define CCP2M2                        339
#define CCP2M3                        340
#define DC2B0                         341
#define DCP2Y                         342
#define CCP2Y                         343
#define DC2B                          344
#define DC2B1                         345
#define DCP2X                         346
#define CCP2X                         347
#define CCP1CON                       348
#define CCP1M0                        349
#define CCP1M                         350
#define CCP1M1                        351
#define CCP1M2                        352
#define CCP1M3                        353
#define CCP1Y                         354
#define DCP1Y                         355
#define DC1B                          356
#define DC1B0                         357
#define CCP1X                         358
#define DCP1X                         359
#define DC1B1                         360
#define ADCON2                        361
#define ADCS0                         362
#define ADCS                          363
#define ADCS1                         364
#define ADCS2                         365
#define ACQT0                         366
#define ACQT                          367
#define ACQT1                         368
#define ACQT2                         369
#define ADFM                          370
#define ADCON1                        371
#define PCFG0                         372
#define PCFG                          373
#define PCFG1                         374
#define PCFG2                         375
#define CHSN3                         376
#define PCFG3                         377
#define VCFG                          378
#define VCFG0                         379
#define VCFG01                        380
#define VCFG11                        381
#define VCFG1                         382
#define ADCON0                        383
#define ADON                          384
#define nDONE                         385
#define GO_nDONE                      386
#define NOT_DONE                      387
#define GODONE                        388
#define GO_DONE                       389
#define DONE                          390
#define GO_NOT_DONE                   391
#define GO                            392
#define CHS                           393
#define CHS0                          394
#define CHS1                          395
#define CHS2                          396
#define CHS3                          397
#define SSPCON2                       398
#define SEN                           399
#define RSEN                          400
#define PEN                           401
#define RCEN                          402
#define ACKEN                         403
#define ACKDT                         404
#define ACKSTAT                       405
#define GCEN                          406
#define SSPCON1                       407
#define SSPM0                         408
#define SSPM                          409
#define SSPM1                         410
#define SSPM2                         411
#define SSPM3                         412
#define CKP                           413
#define SSPEN                         414
#define SSPOV                         415
#define WCOL                          416
#define SSPSTAT                       417
#define BF                            418
#define UA                            419
#define R_NOT_W                       420
#define READ_WRITE                    421
#define NOT_W                         422
#define R_W                           423
#define RW                            424
#define R                             425
#define NOT_WRITE                     426
#define nW                            427
#define nWRITE                        428
#define R_nW                          429
#define I2C_READ                      430
#define START                         431
#define S                             432
#define I2C_START                     433
#define STOP                          434
#define I2C_STOP                      435
#define P                             436
#define NOT_A                         437
#define I2C_DATA                      438
#define nA                            439
#define D_nA                          440
#define D                             441
#define DA                            442
#define DATA_ADDRESS                  443
#define D_A                           444
#define D_NOT_A                       445
#define NOT_ADDRESS                   446
#define nADDRESS                      447
#define I2C_DAT                       448
#define CKE                           449
#define SMP                           450
#define T2CON                         451
#define T2CKPS0                       452
#define T2CKPS                        453
#define T2CKPS1                       454
#define TMR2ON                        455
#define TOUTPS0                       456
#define TOUTPS                        457
#define TOUTPS1                       458
#define TOUTPS2                       459
#define TOUTPS3                       460
#define PR2                           461
#define WM0                           462
#define WM1                           463
#define WAIT0                         464
#define WAIT1                         465
#define EBDIS                         466
#define T1CON                         467
#define TMR1ON                        468
#define TMR1CS                        469
#define NOT_T1SYNC                    470
#define T1SYNC                        471
#define nT1SYNC                       472
#define T1OSCEN                       473
#define SOSCEN                        474
#define T1CKPS0                       475
#define T1CKPS                        476
#define T1CKPS1                       477
#define T1RUN                         478
#define T1CON_RD16                    479
#define T1RD16                        480
#define RCON                          481
#define BOR                           482
#define NOT_BOR                       483
#define nBOR                          484
#define POR                           485
#define nPOR                          486
#define NOT_POR                       487
#define nPD                           488
#define NOT_PD                        489
#define PD                            490
#define NOT_TO                        491
#define nTO                           492
#define TO                            493
#define nRI                           494
#define NOT_RI                        495
#define RI                            496
#define IPEN                          497
#define WDTCON                        498
#define SWDTE                         499
#define SWDTEN                        500
#define LVDCON                        501
#define LVDL0                         502
#define LVDL                          503
#define LVDL1                         504
#define LVDL2                         505
#define LVDL3                         506
#define LVDEN                         507
#define IRVST                         508
#define IVRST                         509
#define OSCCON                        510
#define SCS0                          511
#define SCS                           512
#define SCS1                          513
#define FLTS                          514
#define IOFS                          515
#define OSTS                          516
#define IRCF                          517
#define IRCF0                         518
#define IRCF1                         519
#define IRCF2                         520
#define IDLEN                         521
